Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_image (InputLayer)           [(None, 144, 144, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 144, 144, 32) 896         in_image[0][0]                   
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 144, 144, 32) 128         conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 144, 144, 32) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 144, 144, 32) 9248        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 144, 144, 32) 128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 144, 144, 32) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 72, 72, 32)   0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 72, 72, 64)   18496       max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 72, 72, 64)   256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 72, 72, 64)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 72, 72, 64)   36928       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 72, 72, 64)   256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 72, 72, 64)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 36, 36, 64)   0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 36, 36, 128)  73856       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 36, 36, 128)  512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 36, 36, 128)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 36, 36, 128)  147584      activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 36, 36, 128)  512         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 36, 36, 128)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 18, 18, 128)  0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 18, 18, 256)  295168      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 18, 18, 256)  1024        conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 18, 18, 256)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 18, 18, 256)  590080      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 18, 18, 256)  1024        conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 18, 18, 256)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 9, 9, 256)    0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 9, 9, 512)    1180160     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 9, 9, 512)    2048        conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 9, 9, 512)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 4, 4, 512)    0           activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 4, 4, 512)    2359808     max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 4, 4, 512)    2048        conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 4, 4, 512)    0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 2, 2, 512)    0           activation_9[0][0]               
__________________________________________________________________________________________________
out_encoder (Flatten)           (None, 2048)         0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         2098176     out_encoder[0][0]                
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 1024)         4096        dense[0][0]                      
__________________________________________________________________________________________________
out_latent_1 (Activation)       (None, 1024)         0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 2048)         2099200     out_latent_1[0][0]               
__________________________________________________________________________________________________
z_logvar (Dense)                (None, 2048)         2099200     out_latent_1[0][0]               
__________________________________________________________________________________________________
z_sampling (Lambda)             (None, 2048)         0           z_mean[0][0]                     
                                                                 z_logvar[0][0]                   
__________________________________________________________________________________________________
reshape (Reshape)               (None, 2, 2, 512)    0           z_sampling[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 4, 4, 64)     294976      reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 4, 4, 64)     256         conv2d_transpose[0][0]           
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 2, 2, 512)    0           z_sampling[0][0]                 
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 4, 4, 64)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 4, 4, 64)     294976      reshape_1[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 4, 4, 512)    295424      activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 4, 4, 64)     256         conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 4, 4, 512)    2048        conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 4, 4, 64)     0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 4, 4, 512)    0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 4, 4, 512)    295424      activation_26[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 9, 9, 64)     294976      activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 4, 4, 512)    2048        conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 9, 9, 64)     256         conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 4, 4, 512)    0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 9, 9, 64)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 9, 9, 64)     294976      activation_27[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 9, 9, 512)    295424      activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 9, 9, 64)     256         conv2d_transpose_7[0][0]         
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 9, 9, 512)    2048        conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 9, 9, 64)     0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 9, 9, 512)    0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 9, 9, 512)    295424      activation_28[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 18, 18, 64)   294976      activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 9, 9, 512)    2048        conv2d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 18, 18, 64)   256         conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 9, 9, 512)    0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 18, 18, 64)   0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 18, 18, 64)   294976      activation_29[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 18, 18, 256)  147712      activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 18, 18, 64)   256         conv2d_transpose_8[0][0]         
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 18, 18, 256)  1024        conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 18, 18, 64)   0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 18, 18, 256)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 18, 18, 256)  147712      activation_30[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 18, 18, 256)  590080      activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 18, 18, 256)  1024        conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 18, 18, 256)  1024        conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 18, 18, 256)  0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 18, 18, 256)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 18, 18, 256)  590080      activation_31[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 36, 36, 64)   147520      activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 18, 18, 256)  1024        conv2d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 36, 36, 64)   256         conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 18, 18, 256)  0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 36, 36, 64)   0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 36, 36, 64)   147520      activation_32[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 36, 36, 128)  73856       activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 36, 36, 64)   256         conv2d_transpose_9[0][0]         
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 36, 36, 128)  512         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 36, 36, 64)   0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 36, 36, 128)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 36, 36, 128)  73856       activation_33[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 36, 36, 128)  147584      activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 36, 36, 128)  512         conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 36, 36, 128)  512         conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 36, 36, 128)  0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 36, 36, 128)  0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 36, 36, 128)  147584      activation_34[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 72, 72, 64)   73792       activation_19[0][0]              
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 36, 36, 128)  512         conv2d_25[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 72, 72, 64)   256         conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 36, 36, 128)  0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 72, 72, 64)   0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 72, 72, 64)   73792       activation_35[0][0]              
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 72, 72, 64)   36928       activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 72, 72, 64)   256         conv2d_transpose_10[0][0]        
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 72, 72, 64)   256         conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 72, 72, 64)   0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 72, 72, 64)   0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 72, 72, 64)   36928       activation_36[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 72, 72, 64)   36928       activation_21[0][0]              
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 72, 72, 64)   256         conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 72, 72, 64)   256         conv2d_17[0][0]                  
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 72, 72, 64)   0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 72, 72, 64)   0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 72, 72, 64)   36928       activation_37[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 144, 144, 64) 36928       activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 72, 72, 64)   256         conv2d_27[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 144, 144, 64) 256         conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 72, 72, 64)   0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 144, 144, 64) 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 144, 144, 64) 36928       activation_38[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 144, 144, 32) 18464       activation_23[0][0]              
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 144, 144, 64) 256         conv2d_transpose_11[0][0]        
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 144, 144, 32) 128         conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 144, 144, 64) 0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 144, 144, 32) 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 144, 144, 32) 18464       activation_39[0][0]              
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 144, 144, 32) 9248        activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 144, 144, 32) 128         conv2d_28[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 144, 144, 32) 128         conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 144, 144, 32) 0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 144, 144, 32) 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
in_mask (InputLayer)            [(None, 144, 144, 1) 0                                            
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 144, 144, 32) 9248        activation_40[0][0]              
__________________________________________________________________________________________________
out_image_pre (Conv2D)          (None, 144, 144, 3)  867         activation_25[0][0]              
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (None, 144, 144, 1)  0           in_mask[0][0]                    
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 144, 144, 32) 128         conv2d_29[0][0]                  
__________________________________________________________________________________________________
multiply (Multiply)             (None, 144, 144, 3)  0           out_image_pre[0][0]              
                                                                 in_mask[0][0]                    
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 144, 144, 3)  0           in_image[0][0]                   
                                                                 tf.math.subtract[0][0]           
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 144, 144, 32) 0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
out_image (Add)                 (None, 144, 144, 3)  0           multiply[0][0]                   
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
out_mask (Conv2D)               (None, 144, 144, 1)  289         activation_41[0][0]              
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None, 2048)         0           z_logvar[0][0]                   
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 2048)         0           tf.math.multiply[0][0]           
__________________________________________________________________________________________________
tf.math.square (TFOpLambda)     (None, 2048)         0           z_mean[0][0]                     
__________________________________________________________________________________________________
tf.math.multiply_1 (TFOpLambda) (None, 2048)         0           z_logvar[0][0]                   
__________________________________________________________________________________________________
tf.math.subtract_1 (TFOpLambda) (None, 2048)         0           tf.__operators__.add[0][0]       
                                                                 tf.math.square[0][0]             
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 2048)         0           tf.math.multiply_1[0][0]         
__________________________________________________________________________________________________
tf.math.subtract_2 (TFOpLambda) (None, 2048)         0           tf.math.subtract_1[0][0]         
                                                                 tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.reduce_mean (TFOpLambda ()                   0           tf.math.subtract_2[0][0]         
__________________________________________________________________________________________________
tf.math.multiply_2 (TFOpLambda) ()                   0           tf.math.reduce_mean[0][0]        
__________________________________________________________________________________________________
add_loss (AddLoss)              ()                   0           tf.math.multiply_2[0][0]         
__________________________________________________________________________________________________
add_metric (AddMetric)          ()                   0           tf.math.multiply_2[0][0]         
__________________________________________________________________________________________________
tf.image.ssim (TFOpLambda)      (None,)              0           in_image[0][0]                   
                                                                 out_image[0][0]                  
__________________________________________________________________________________________________
tf.math.subtract_3 (TFOpLambda) (None,)              0           tf.image.ssim[0][0]              
__________________________________________________________________________________________________
tf.math.reduce_mean_1 (TFOpLamb ()                   0           tf.math.subtract_3[0][0]         
__________________________________________________________________________________________________
tf.math.reduce_mean_2 (TFOpLamb ()                   0           tf.math.reduce_mean_1[0][0]      
__________________________________________________________________________________________________
add_loss_1 (AddLoss)            ()                   0           tf.math.reduce_mean_2[0][0]      
__________________________________________________________________________________________________
add_metric_1 (AddMetric)        ()                   0           tf.math.reduce_mean_2[0][0]      
__________________________________________________________________________________________________
tf.convert_to_tensor (TFOpLambd (None, 144, 144, 3)  0           out_image[0][0]                  
__________________________________________________________________________________________________
tf.convert_to_tensor_1 (TFOpLam (None, 144, 144, 3)  0           in_image[0][0]                   
__________________________________________________________________________________________________
tf.convert_to_tensor_2 (TFOpLam (None, 144, 144, 3)  0           tf.convert_to_tensor[0][0]       
__________________________________________________________________________________________________
tf.cast (TFOpLambda)            (None, 144, 144, 3)  0           tf.convert_to_tensor_1[0][0]     
__________________________________________________________________________________________________
tf.math.subtract_4 (TFOpLambda) (None, 144, 144, 3)  0           tf.convert_to_tensor_2[0][0]     
                                                                 tf.cast[0][0]                    
__________________________________________________________________________________________________
tf.math.abs (TFOpLambda)        (None, 144, 144, 3)  0           tf.math.subtract_4[0][0]         
__________________________________________________________________________________________________
tf.math.reduce_mean_3 (TFOpLamb (None, 144, 144)     0           tf.math.abs[0][0]                
__________________________________________________________________________________________________
tf.cast_1 (TFOpLambda)          (None, 144, 144)     0           tf.math.reduce_mean_3[0][0]      
__________________________________________________________________________________________________
tf.math.multiply_3 (TFOpLambda) (None, 144, 144)     0           tf.cast_1[0][0]                  
__________________________________________________________________________________________________
tf.math.reduce_sum (TFOpLambda) ()                   0           tf.math.multiply_3[0][0]         
__________________________________________________________________________________________________
tf.compat.v1.size (TFOpLambda)  ()                   0           tf.math.multiply_3[0][0]         
__________________________________________________________________________________________________
tf.math.reduce_sum_1 (TFOpLambd ()                   0           tf.math.reduce_sum[0][0]         
__________________________________________________________________________________________________
tf.cast_2 (TFOpLambda)          ()                   0           tf.compat.v1.size[0][0]          
__________________________________________________________________________________________________
tf.math.divide_no_nan (TFOpLamb ()                   0           tf.math.reduce_sum_1[0][0]       
                                                                 tf.cast_2[0][0]                  
__________________________________________________________________________________________________
tf.cast_3 (TFOpLambda)          ()                   0           tf.math.divide_no_nan[0][0]      
__________________________________________________________________________________________________
tf.math.multiply_4 (TFOpLambda) ()                   0           tf.cast_3[0][0]                  
__________________________________________________________________________________________________
add_loss_2 (AddLoss)            ()                   0           tf.math.multiply_4[0][0]         
__________________________________________________________________________________________________
add_metric_2 (AddMetric)        ()                   0           tf.math.multiply_4[0][0]         
__________________________________________________________________________________________________
tf.convert_to_tensor_4 (TFOpLam (None, 144, 144, 1)  0           in_mask[0][0]                    
__________________________________________________________________________________________________
tf.convert_to_tensor_3 (TFOpLam (None, 144, 144, 1)  0           out_mask[0][0]                   
__________________________________________________________________________________________________
tf.cast_4 (TFOpLambda)          (None, 144, 144, 1)  0           tf.convert_to_tensor_4[0][0]     
__________________________________________________________________________________________________
tf.convert_to_tensor_5 (TFOpLam (None, 144, 144, 1)  0           tf.convert_to_tensor_3[0][0]     
__________________________________________________________________________________________________
tf.keras.backend.binary_crossen (None, 144, 144, 1)  0           tf.cast_4[0][0]                  
                                                                 tf.convert_to_tensor_5[0][0]     
__________________________________________________________________________________________________
tf.math.reduce_mean_4 (TFOpLamb (None, 144, 144)     0           tf.keras.backend.binary_crossentr
__________________________________________________________________________________________________
tf.math.multiply_6 (TFOpLambda) (None, 144, 144, 1)  0           in_mask[0][0]                    
                                                                 out_mask[0][0]                   
__________________________________________________________________________________________________
tf.math.square_1 (TFOpLambda)   (None, 144, 144, 1)  0           in_mask[0][0]                    
__________________________________________________________________________________________________
tf.math.square_2 (TFOpLambda)   (None, 144, 144, 1)  0           out_mask[0][0]                   
__________________________________________________________________________________________________
tf.cast_5 (TFOpLambda)          (None, 144, 144)     0           tf.math.reduce_mean_4[0][0]      
__________________________________________________________________________________________________
tf.math.abs_1 (TFOpLambda)      (None, 144, 144, 1)  0           tf.math.multiply_6[0][0]         
__________________________________________________________________________________________________
tf.__operators__.add_1 (TFOpLam (None, 144, 144, 1)  0           tf.math.square_1[0][0]           
                                                                 tf.math.square_2[0][0]           
__________________________________________________________________________________________________
tf.math.multiply_5 (TFOpLambda) (None, 144, 144)     0           tf.cast_5[0][0]                  
__________________________________________________________________________________________________
tf.math.reduce_sum_4 (TFOpLambd ()                   0           tf.math.abs_1[0][0]              
__________________________________________________________________________________________________
tf.math.reduce_sum_5 (TFOpLambd ()                   0           tf.__operators__.add_1[0][0]     
__________________________________________________________________________________________________
tf.math.reduce_sum_2 (TFOpLambd ()                   0           tf.math.multiply_5[0][0]         
__________________________________________________________________________________________________
tf.compat.v1.size_1 (TFOpLambda ()                   0           tf.math.multiply_5[0][0]         
__________________________________________________________________________________________________
tf.math.multiply_7 (TFOpLambda) ()                   0           tf.math.reduce_sum_4[0][0]       
__________________________________________________________________________________________________
tf.__operators__.add_3 (TFOpLam ()                   0           tf.math.reduce_sum_5[0][0]       
__________________________________________________________________________________________________
tf.math.reduce_sum_3 (TFOpLambd ()                   0           tf.math.reduce_sum_2[0][0]       
__________________________________________________________________________________________________
tf.cast_6 (TFOpLambda)          ()                   0           tf.compat.v1.size_1[0][0]        
__________________________________________________________________________________________________
tf.__operators__.add_2 (TFOpLam ()                   0           tf.math.multiply_7[0][0]         
__________________________________________________________________________________________________
tf.__operators__.add_4 (TFOpLam ()                   0           tf.__operators__.add_3[0][0]     
__________________________________________________________________________________________________
tf.math.divide_no_nan_1 (TFOpLa ()                   0           tf.math.reduce_sum_3[0][0]       
                                                                 tf.cast_6[0][0]                  
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    ()                   0           tf.__operators__.add_2[0][0]     
                                                                 tf.__operators__.add_4[0][0]     
__________________________________________________________________________________________________
tf.cast_7 (TFOpLambda)          ()                   0           tf.math.divide_no_nan_1[0][0]    
__________________________________________________________________________________________________
tf.math.subtract_5 (TFOpLambda) ()                   0           tf.math.truediv[0][0]            
__________________________________________________________________________________________________
tf.__operators__.add_5 (TFOpLam ()                   0           tf.cast_7[0][0]                  
                                                                 tf.math.subtract_5[0][0]         
__________________________________________________________________________________________________
add_loss_3 (AddLoss)            ()                   0           tf.__operators__.add_5[0][0]     
__________________________________________________________________________________________________
add_metric_3 (AddMetric)        ()                   0           tf.__operators__.add_5[0][0]     
==================================================================================================
Total params: 16,630,564
Trainable params: 16,615,076
Non-trainable params: 15,488
__________________________________________________________________________________________________
